Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 200, 64)      832         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 200, 64)      832         input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 100, 64)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 100, 64)      0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 50, 64)       0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 50, 64)       0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 3200)         0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 3200)         0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 697)          2231097     flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 697)          2231097     flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 697)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 697)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 697)          0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 512)          357376      add_1[0][0]                      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 512)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          262656      dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 512)          0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 886)          454518      dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 886)          454518      dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 200)          177400      dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 200)          177400      dense_5[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 50)           10050       dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 100)          20100       dense_7[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 5)            255         dense_10[0][0]                   
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 5)            505         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 5)            505         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 5)            505         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 5)            505         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 5)            505         dense_9[0][0]                    
==================================================================================================
Total params: 6,380,656
Trainable params: 6,380,656
Non-trainable params: 0
__________________________________________________________________________________________________
