Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 200, 64)      832         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 200, 64)      832         input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 200, 64)      832         input_3[0][0]                    
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 200, 64)      832         input_4[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 100, 64)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 100, 64)      0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_11 (MaxPooling1D) (None, 100, 64)      0           conv1d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_16 (MaxPooling1D) (None, 100, 64)      0           conv1d_13[0][0]                  
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 97, 64)       16448       max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 97, 64)       16448       max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 97, 64)       16448       max_pooling1d_11[0][0]           
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 97, 64)       16448       max_pooling1d_16[0][0]           
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 48, 64)       0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 48, 64)       0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_12 (MaxPooling1D) (None, 48, 64)       0           conv1d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_17 (MaxPooling1D) (None, 48, 64)       0           conv1d_14[0][0]                  
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 45, 64)       16448       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 45, 64)       16448       max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 45, 64)       16448       max_pooling1d_12[0][0]           
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 45, 64)       16448       max_pooling1d_17[0][0]           
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 22, 64)       0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 22, 64)       0           conv1d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_13 (MaxPooling1D) (None, 22, 64)       0           conv1d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_18 (MaxPooling1D) (None, 22, 64)       0           conv1d_15[0][0]                  
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 19, 64)       16448       max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 19, 64)       16448       max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 19, 64)       16448       max_pooling1d_13[0][0]           
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 19, 64)       16448       max_pooling1d_18[0][0]           
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 9, 64)        0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 9, 64)        0           conv1d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_14 (MaxPooling1D) (None, 9, 64)        0           conv1d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_19 (MaxPooling1D) (None, 9, 64)        0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 4, 64)        0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, 4, 64)        0           max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
max_pooling1d_15 (MaxPooling1D) (None, 4, 64)        0           max_pooling1d_14[0][0]           
__________________________________________________________________________________________________
max_pooling1d_20 (MaxPooling1D) (None, 4, 64)        0           max_pooling1d_19[0][0]           
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 256)          0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 256)          0           max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 256)          0           max_pooling1d_15[0][0]           
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 256)          0           max_pooling1d_20[0][0]           
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256)          0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 256)          0           flatten_3[0][0]                  
                                                                 flatten_4[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 643)          165251      add_1[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 643)          165251      add_2[0][0]                      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 643)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 643)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
add_3 (Add)                     (None, 643)          0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1943)         1251292     add_3[0][0]                      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1943)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1943)         3777192     dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 1943)         0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 854)          1660176     dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 854)          1660176     dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 600)          513000      dense_5[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 600)          513000      dense_6[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 600)          360600      dense_7[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 600)          360600      dense_8[0][0]                    
==================================================================================================
Total params: 10,627,242
Trainable params: 10,627,242
Non-trainable params: 0
__________________________________________________________________________________________________
