Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 200, 3)       0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 200, 64)      832         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 200, 64)      832         input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 100, 64)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 100, 64)      0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 97, 64)       16448       max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 97, 64)       16448       max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 48, 64)       0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 48, 64)       0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 45, 64)       16448       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 45, 64)       16448       max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 22, 64)       0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 22, 64)       0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1408)         0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1408)         0           max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 740)          1042660     flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 740)          1042660     flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 740)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 740)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 740)          0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1126)         834366      add_1[0][0]                      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1126)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 600)          676200      dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 600)          676200      dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 600)          676200      dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 600)          676200      dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 600)          360600      dense_4[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 600)          360600      dense_5[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 600)          360600      dense_6[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 600)          360600      dense_7[0][0]                    
==================================================================================================
Total params: 7,134,342
Trainable params: 7,134,342
Non-trainable params: 0
__________________________________________________________________________________________________
